<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
   <title>3. fejezet - Statikus tesztelési technikák</title><link rel="stylesheet" href="style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="index.html" title="Szoftvertesztelés"><link rel="up" href="index.html" title="Szoftvertesztelés"><link rel="prev" href="ch02s03.html" title="2.3. Módszertanok"><link rel="next" href="ch03s02.html" title="3.2. Statikus elemzés"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">3. fejezet - Statikus tesztelési technikák</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch02s03.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch03s02.html">Következ&#337;</a></td></tr></table><hr></div><div class="chapter" title="3. fejezet - Statikus tesztelési technikák"><div class="titlepage"><div><div><h2 class="title"><a name="d0e1146"></a>3. fejezet - Statikus tesztelési technikák</h2></div></div></div><p>A statikus tesztelési technikák a szoftver forrás kódját vizsgálják fordítási id&#337;ben. Ide tartozik a dokumentáció felülvizsgálata is. A statikus tesztelés párja a dinamikus tesztelés, amely a szoftvert futásid&#337;ben teszteli.</p><p>A statikus tesztelési technikáknak két fajtája van:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>felülvizsgálat és</p></li><li class="listitem"><p>statikus elemzés.</p></li></ol></div><p>A felülvizsgálat a kód, illetve a dokumentáció, vagy ezek együttes manuális átnézését jelenti. Ide tartozik például a páros programozás. A statikus elemzés a kód, illetve a dokumentáció automatikus vizsgálatát jelenti, ahol a statikus elemzést végz&#337; segédeszköz megvizsgálja a kódot (illetve a dokumentációt), hogy bizonyos szabályoknak megfelel-e. Ide tartozik például a helyesírás ellen&#337;rzés.</p><p>A statikus technikával más típusú hibák találhatóak meg könnyen, mint a dinamikus tesztelési technikákkal. Statikus technikákkal könnyen megtalálhatóak azok a kód sorok, ahol null referencián keresztül akarunk metódust hívni. Ugyanezt elérni dinamikus teszteléssel nagyon költséges, hiszen 100%-os kód lefedettség kell hozzá. Ugyanakkor dinamikus teszteléssel könnyen észrevehet&#337;, hogy ha rossz képlet alapján számítjuk pl. az árengedményt. Ugyanezt statikusan nehéz észrevenni, hacsak nincs egy szemfüles vezet&#337; programozónk, aki átlátja az üzleti oldalt is. </p><p>A statikus tesztelési technikák el&#337;nye, hogy nagyon korán alkalmazhatóak, már akkor is, amikor még nincs is futtatható verzió. így hamarabb lehet velük hibákat találni és így gazdaságosabb a hibajavítás.</p><div class="sect1" title="3.1. Felülvizsgálat"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e1166"></a>3.1. 
      
            <a name="__RefHeading__3509_600791787"></a>Felülvizsgálat</h2></div></div></div><p>A felülvizsgálat azt jelenti, hogy manuálisan átnézzük a forráskódot és fejben futtatjuk vagy egyszer&#369;en csak gyanús részeket keresünk benne. Ezzel szemben áll a statikus elemzés, ahol szoftverekkel nézetjük át automatikusan a forráskódot. A felülvizsgálat fehérdobozos teszt, mivel kell hozzá a forráskód. A felülvizsgálat lehet informális, pl. páros programozás, de akár nagyon formális is, amikor a folyamatot jól dokumentáljuk, illetve a két széls&#337;ség közti átmenetek.</p><p>Ezeket a hibákat könnyebb felülvizsgálattal megtalálni, mint más technikákkal:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>szabványoktól / kódolási szabályoktól való eltérések,</p></li><li class="listitem"><p>követelményekkel kapcsolatos hibák, pl. nincs minden funkcionális követelményhez funkció,</p></li><li class="listitem"><p>tervezési hibák, pl. az adatbázis nincs harmadik normál-formában,</p></li><li class="listitem"><p>karbantarthatóság hiánya, pl. nincs biztonsági mentés és visszaállítás funkció,</p></li><li class="listitem"><p>hibás interfész-specifikációk, pl. dokumentálatlan feltételezések.</p></li></ol></div><p>A felülvizsgálat legismertebb típusai:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>informális felülvizsgálat (csoporton belüli),</p></li><li class="listitem"><p>átvizsgálás (házon belüli),</p></li><li class="listitem"><p>technikai felülvizsgálat (küls&#337;s szakér&#337; bevonásával rövid idej&#369;),</p></li><li class="listitem"><p>inspekció (küls&#337;s szakér&#337; bevonásával hosszú idej&#369;).</p></li></ol></div><div class="sect2" title="3.1.1. Informális felülvizsgálat"><div class="titlepage"><div><div><h3 class="title"><a name="d0e1206"></a>3.1.1. 
      
               <a name="__RefHeading__3511_600791787"></a>Informális felülvizsgálat</h3></div></div></div><p>Sok szoftvercégnél elfogadott megoldás, hogy egy tapasztalt programozó átnézi (review) a kezd&#337;k kódját. A kezd&#337;k a kritikából rengeteg tapasztalatot szerezhetnek. A kockázatosnak ítélt részeket (pl. amire gyakran kerül a vezérlés, vagy kevésbé ismert megoldást alkalmaz) több tapasztalt programozó is átnézheti. Ennek hatékonysága függ az átnéz&#337;k rátermettségét&#337;l. Ez talán a leginformálisabb megoldás.</p><p>Ehhez hasonló a páros programozás (pair programming) is. Ekkor két programozó ír egy kódot, pontosabban az egyik írja, a másik figyeli. Ha a figyel&#337; hibát lát vagy nem érti a kódot, akkor azonnal szól. A két programozó folyamatosan megbeszéli, hogy hogyan érdemes megoldani az adott problémát.</p><p>A kódszépítés (refactoring) egy másik módja a felülvizsgálatnak. Ilyenkor a már letesztelt, m&#369;köd&#337; kódot lehet szépíteni, ami esetleg lassú, rugalmatlan, vagy egyszer&#369;en csak csúnya. A kódszépítés el&#337;feltétele, hogy legyen sok unit-teszt. A szépítés során nem szabad megváltoztatni a kód funkcionalitását, de a szerkezet, pl. egy metódus törzse, szabadon változtatható. A szépítés után minden unit-tesztet le kell futtatni, nem csak a megváltozott kódhoz tartozókat, hogy lássuk, a változások okoztak-e hibát. A kódszépítést a szerz&#337; és egy tapasztalt programozó végzi közösen.</p><p>Az informális felülvizsgálat legf&#337;bb jellemz&#337;i:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>informális, a fejleszt&#337; csapaton belüli felülvizsgálat,</p></li><li class="listitem"><p>kezdeményezheti a szerz&#337; vagy egy tapasztaltabb fejleszt&#337;, ritkán a menedzsment,</p></li><li class="listitem"><p>hatékonysága függ az átnéz&#337; személyét&#337;l, minél tapasztaltabb, annál több hibát vehet észre,</p></li><li class="listitem"><p>célja a korai költséghatékony hiba felderítés.</p></li></ol></div></div><div class="sect2" title="3.1.2. átvizsgálás"><div class="titlepage"><div><div><h3 class="title"><a name="d0e1232"></a>3.1.2. 
      
               <a name="__RefHeading__3513_600791787"></a>átvizsgálás</h3></div></div></div><p>Ez már kicsit formálisabb módja a felülvizsgálatnak. általában a módszertan el&#337;írja, hogy az elkészült kisebb-nagyobb modulokat ismertetni kell a csapat többi tagjával, a többi csapattal. Célja, hogy a mások is átlássák az általunk írt kódrészletet (ez csökkenti a kárt, amit egy programozó elvesztése okozhat, lásd kockázat menedzsment), kritikai megjegyzéseikkel segítsék a kód min&#337;ségének javítását. Aszerint, hogy hány embernek mutatjuk be az elkészült modult, ezekr&#337;l beszélhetünk:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>váll feletti átnézés (over-the-shoulder review),</p></li><li class="listitem"><p>forráskód átnézés (code review),</p></li><li class="listitem"><p>kód átvétel (code acceptance review)</p></li><li class="listitem"><p>körbeküldés (pass-around),</p></li><li class="listitem"><p>csoportos átnézés (team review),</p></li><li class="listitem"><p>felület átnézés (interface review),</p></li><li class="listitem"><p>kód prezentálás (code presentation).</p></li></ol></div><p>Váll feletti átnézés (over-the-shoulder review): Az egyik programozó egy ideje nézi saját forráskódját, de nem találja a hibát. Valamelyik kollégáját megkéri, hogy segítsen. Mialatt elmagyarázza a problémát, általában rá is jön a megoldásra. Ha mégsem, akkor a kollégának lehet egy jó ötlete, hogy mi okozhatja a hibát. általában ennyi elég is a hiba megtalálásához. Ha nem, jöhet a forráskód átnézés.</p><p>Forráskód átnézés (code review): A kód írója megkér egy tapasztalt programozót, hogy segítsen megtalálni egy nehezen megtalálható hibát. Együtt nyomkövetik a programot, miközben a szerz&#337; magyarázza, mit miért csinált. Ellen&#337;rzik, hogy a kód megfelel-e a specifikációnak. Ezt addig fojtatják, amíg meg nem találják a hibát. </p><p>Kód átvétel (code acceptance review): Az elkészült nagyobb modulokat, pl. osztályokat, a vezet&#337; fejleszt&#337; vagy egy tapasztalt programozó átnézi, hogy van-e benne hiba, nem érthet&#337;, nem dokumentált rész. A modul fejleszt&#337;i elmagyarázzák mit és miért csináltak. A vezet&#337; fejleszt&#337; elmondja, hogyan lehet ezt jobban, szebben csinálni. Ha hibát talál (ez gyakran logikai hiba), akkor arra rámutat, vázolja a javítást.</p><p>Körbeküldés (pass-around): A kód szerz&#337;je körbeküldi az általa írt kódrészletet, ami akár egy egész modul is lehet. A címzettek véleményezik a kódot, például megírják, melyik részét érdemes tesztelni. A körbeküldés általában megel&#337;zi a kód felvételét a verziókövet&#337; rendszerbe. általában csak akkor használják, ha egy kódrészlet kritikus fontosságú, pl. egy sokak által használt interfész. Az intenzív kommunikációt el&#337;író módszertanokra (pl. Scrum) nem jellemz&#337;.</p><p>Csoportos átnézés (team review): A csoportos átnézés a körbeküldést helyettesíti. Itt is egy érzékeny kódrészletet néznek át többen, de interaktívan. A kódot a szerz&#337; prezentálja, sorról sorra magyarázza. általában elvárás, hogy ha valaki valamit nem ért, azonnal szóljon. A prezentáció végén a vezet&#337; programozó elmondja, szerinte mit lehetett volna jobban csinálni. Ehhez is gyakran hozzászólnak a többiek. Több módszertan (pl. extrém programozás) limitálja ezen alkalmak id&#337;hosszát fél vagy egy órában.</p><p>Felület átnézés (interface review): Hasonló a csoportos átnézéshez, de itt általában több embernek mutatjuk be azt az interfészt, amelyen keresztül a csoportunk fejlesztése lesz elérhet&#337;. Ez azért fontos, hogy az egyes csoportok egyeztetni tudják elvárásaikat egymás felé. Ezeket rögzítik és az integrációs teszt során felhasználják.</p><p>Kód prezentálás (code presentation): Hasonló a csoportos átnézéshez, de az érdekes kódot nem a csoporton belül, hanem a cégen belül mutatjuk be. Akkor gyakori, ha több telephelyen fejlesztik ugyanazt a szoftvert. Nem feltétlenül az egész cég vesz részt benne, lehet, hogy csak három ember, de könnyen el&#337;fordulhat, hogy ezek más-más kontinensen vannak. A kód prezentálás célja lehet egy hiba bemutatása, amit egy másik csapat talált és megkéri a kód tulajdonosát, hogy javítsa. Másik gyakori cél a csúcs fejleszt&#337;k összehozása, hogy a keretrendszer továbbfejlesztését megbeszéljék.</p><p>Az átvizsgálás legf&#337;bb jellemz&#337;i:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>a moderátor maga a szerz&#337;, lehet jegyz&#337;könyvvezet&#337; is, de az nem a szerz&#337;,</p></li><li class="listitem"><p>a résztvev&#337;k a cég alkalmazottai, küls&#337; szakért&#337;k nem jellemz&#337;ek,</p></li><li class="listitem"><p>lehet informális és formális is, ha formális, akkor van pl. jegyz&#337;könyv,</p></li><li class="listitem"><p>általában a módszertan írja el&#337; vagy a menedzsment kezdeményezi,</p></li><li class="listitem"><p>a szerz&#337;k jól felkészülnek, pl. szemléltet&#337; ábrákat készítenek, a többi résztvev&#337; átnézi a kapcsolódó dokumentációt,</p></li><li class="listitem"><p>célja az elkészült modulok ismertetése, megértések, azokban hibakeresés.</p></li></ol></div></div><div class="sect2" title="3.1.3. Technikai felülvizsgálat"><div class="titlepage"><div><div><h3 class="title"><a name="d0e1296"></a>3.1.3. 
       
               <a name="__RefHeading__3515_600791787"></a>Technikai felülvizsgálat</h3></div></div></div><p>Technikai felülvizsgálatra általában akkor kerül sor, ha a szoftver teljesítményével nem vagyunk elégedettek. Azt általában könny&#369; megtalálni a felhasználói visszajelzések és úgynevezett profiler programok segítségével, hogy mi az a sz&#369;k keresztmetszet (angolul: bottleneck), ami a lassúságot okozza. Ugyanakkor az nagyon nehéz kérdés, hogyan oldjuk fel ezeket a sz&#369;k keresztmetszeteket. Ha lenne egyszer&#369; megoldás, akkor a programozók eleve azt használták volna, tehát ez általában a szoftver cég alkalmazottainak tudását meghaladó probléma.</p><p>Ilyenkor küls&#337; szakért&#337;ket szoktak felkérni, hogy segítsenek. Leggyakrabban egy-egy lekérdezés bizonyul túl lassúnak. Ilyenkor egy index hozzáadás a táblához nagyságrendekkel gyorsítja a lekérdezést. A kérdés már csak az, mit indexeljünk és hogyan. A küls&#337;s szakért&#337;k átnézik a megoldásunkat és javaslatokat adnak.</p><p>Mivel ez a fajta tanácsadás nagyon drága, ezért ez egy jól dokumentált folyamat. A szoftvercég leírja, hogy mi a probléma. Mind a cég alkalmazottai, mind a szakért&#337;k felkészülnek, átnézik a dokumentációkat. A megbeszélést általában egy moderátor vezeti, aki jegyz&#337;könyvet is ír. A moderátor nem lehet a program írója. A résztvev&#337;k megbeszélik, hogy mi a probléma gyökere. A szakért&#337;k több megoldási javaslatot is adnak. Kiválasztanak egy megoldást. Ezt vagy a szerz&#337;, vagy a szakért&#337;k implementálják.</p><p>A technikai vizsgálat másik típusa, amikor küls&#337; szakért&#337;k azt ellen&#337;rzik, hogy a szoftver vagy a dokumentációja megfelel-e az el&#337;írt szabványoknak. Az ellen&#337;rzést nem a megrendel&#337;, hanem a szoftver cég vagy a szabvány hitelesítését végz&#337; szervezet kezdeményezi. Pl. az emberi életre is veszélyes (life-critical) rendszerek dokumentációjára az IEC61508 szabvány vonatkozik. Ennek betartása a cég érdeke, mert ha kiderül, hogy nem tartja be a szabványt, akkor a termékeit akár ki is vonhatják a piacról.</p><p>Akkor is ehhez a technikához fordulnak, ha a szoftverben van egy hiba, amit nagyon nehéz reprodukálni, és a szoftver cég saját alkalmazottai nem tudják megtalálni (megtalálhatatlan hiba). Ez többszálú vagy elosztott rendszereknél fordul általában el&#337; egy holtpont (deadlock) vagy kiéheztetés (starvation) formájában, de lehet ez egy memóriaszivárgás (memory lake) is. Ilyenkor a szakért&#337; megmutatja, hogyan kell azt a statikus elemz&#337; szoftvert használni, pl. egy holtpont keres&#337;t (deadlock checker), ami megtalálja a hibás részt. Az így feltárt hibát általában már a cég szakemberei is javítani tudják.</p><p>A technikai felülvizsgálat legf&#337;bb jellemz&#337;i:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>a szoftver cég kezdeményezi, ha küls&#337; szakért&#337;k bevonására van szüksége,</p></li><li class="listitem"><p>moderátor vezeti (nem a szerz&#337;), jegyz&#337;könyvet vezet,</p></li></ol></div><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>inkább formális, mint informális,</p></li><li class="listitem"><p>a találkozó el&#337;tt a résztvev&#337;k felkészülnek,</p></li><li class="listitem"><p>opcionálisan ellen&#337;rz&#337; lista használata, amit a felek el&#337;re elfogadnak,</p></li><li class="listitem"><p>célja a megtalálhatatlan hibák felderítése, vagy a szoftver lassúságát okozó sz&#369;k keresztmetszetek megszüntetés, vagy szabványok ellen&#337;rzése.</p></li></ol></div></div><div class="sect2" title="3.1.4. Inspekció"><div class="titlepage"><div><div><h3 class="title"><a name="d0e1333"></a>3.1.4. 
      
               <a name="__RefHeading__3517_600791787"></a>Inspekció</h3></div></div></div><p>Ez a legformálisabb felülvizsgálat. Ezt is akkor használjuk, ha küls&#337; szakért&#337; bevonására van szükségünk. A technikai felülvizsgálattól az különbözteti meg, hogy a szoftver cég és a szakért&#337;t adó cég részletesebb szerz&#337;dést köt, amely magában foglalja:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>a megoldandó feladat leírását,</p></li><li class="listitem"><p>azt a célfeltételt, ami a probléma megoldásával el kell érni,</p></li><li class="listitem"><p>a célfeltételben használt metrikák leírását,</p></li><li class="listitem"><p>az inspekciós jelentés formáját.</p></li></ol></div><p>Míg a technikai átnézésnél gyakran csak annyit kérünk a szakért&#337;kt&#337;l, hogy legyen sokkal gyorsabb egy lekérdezés, az inspekció esetén leírjuk pontosan, hogy milyen gyors legyen.</p><p>Az inspekció szó abból jön, hogy a probléma megoldásához általában nem elég csak a szoftver egy részét átvizsgálni, hanem az egész forráskódot adatbázissal együtt inspekció alá kell vonni. Inspekciót alkalmazunk akkor is, ha egy régi (esetleg már nem támogatott programozási nyelven íródott) kódot akarunk szépíteni / átírni, hogy ismét rugalmasan lehessen b&#337;víteni.</p><p>Az inspektornak nagy tekintély&#369; szakembernek kell lennie, mert az általa javasolt változtatások általában nagyon fájóak, nehezen kivitelezhet&#337;ek. Ha nincs meg a bizalom, hogy ezekkel a változtatásokkal el lehet érni a célt, akkor a fejleszt&#337; csapat ellenállásán elbukhat a kezdeményezés.</p><p>Az inspektort általában egy-két hónapig is a fejleszt&#337;k rendelkezésére áll szemben a technikai felülvizsgálattal, amikor a szakért&#337;k gyorsan, akár néhány óra alatt megoldják a problémát. Ezért ugyanannak a szakért&#337;nek a napidíja általában kisebb inspekció esetén, mint technikai felülvizsgálat esetén.</p><p>Az inspekció lehet rövid távú is (egy-két hetes), ha a szakért&#337;re nincs szükség a probléma megoldásához, csak a feltárásához. Ekkor a szakért&#337; egy inspekciós jelentést ír, amely leírja, hogyan kell megoldani a problémát. Ehhez általában csatolni kell egy példa programot is, egy úgynevezett PoC-kot (Proof of Concept), amely alapján a cég saját fejleszt&#337;i is képesek megoldani a problémát. A PoC-oknak demonstrálnia kell, hogy a kívánt metrika értékek elérhet&#337;ek a segítségével.</p><p>Az inspekció legf&#337;bb jellemz&#337;i:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>a szoftvercég kezdeményezi, ha hosszabb távon van szüksége küls&#337; szakért&#337;re,</p></li><li class="listitem"><p>részletes szerz&#337;dés szabályozza, ami a problémát, a célfeltételt és célban szerepl&#337; metrikákat is leírja,</p></li><li class="listitem"><p>opcionálisan PoC-ok (Proof of Concept) készítése,</p></li><li class="listitem"><p>inspekciós jelentés készítése,</p></li><li class="listitem"><p>célja teljesítmény fokozás a szakért&#337; által kiválóan ismert technológia segítségével vagy elavult kód frissítése.</p></li></ol></div></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch02s03.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch03s02.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">2.3. 
      
            Módszertanok&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;3.2. 
      
            Statikus elemzés</td></tr></table></div></body></html>