<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
   <title>4. fejezet - Teszt tervezési technikák</title><link rel="stylesheet" href="style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="index.html" title="Szoftvertesztelés"><link rel="up" href="index.html" title="Szoftvertesztelés"><link rel="prev" href="ch03s02.html" title="3.2. Statikus elemzés"><link rel="next" href="ch04s02.html" title="4.2. A teszt tervezési technikák fajtái"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">4. fejezet - Teszt tervezési technikák</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch03s02.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch04s02.html">Következ&#337;</a></td></tr></table><hr></div><div class="chapter" title="4. fejezet - Teszt tervezési technikák"><div class="titlepage"><div><div><h2 class="title"><a name="d0e1624"></a>4. fejezet - Teszt tervezési technikák</h2></div></div></div><p>Az el&#337;z&#337; fejezetben áttekintettük a statikus tesztelési technikákat. Ezek a módszerek nem igénylik a tesztelend&#337; rendszer futtatását, s&#337;t bizonyos esetekben még a forráskód meglétét sem.</p><p>A dinamikus tesztelési technikák viszont a tesztelend&#337; rendszer futtatását igénylik. Ebben a fejezetben a dinamikus tesztek tervezési kérdéseivel foglalkozunk. Definiáljuk a szükséges fogalmakat, megismerjük a teszt tervezési technikák megközelítési módjait, áttekintjük a legelterjedtebb specifikáció alapú, struktúra alapú és gyakorlat alapú tesztelési technikákat, majd megvizsgáljuk az egyes technikák közötti választás szempontjait.</p><p>A dinamikus tesztelési technikák els&#337;sorban a komponens teszt, azon belül is f&#337;leg a unit-teszt (egységteszt) fázis eszköze.</p><p>Mivel a teszteléssel kapcsolatos magyar nyelv&#369; irodalom máig is igen kevés, az érdekl&#337;d&#337;bb hallgatók els&#337;sorban az angol nyelv&#369; szakirodalom tanulmányozása során juthatnak új ismeretekhez. Ennek megkönnyítésére a fontosabb fogalmak els&#337; el&#337;fordulása során annak angol nyelv&#369; megnevezését is közöljük.</p><p></p><div class="sect1" title="4.1. Alapfogalmak"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e1636"></a>4.1. 
      
            <a name="_Toc291171710"></a>Alapfogalmak</h2></div></div></div><p>A dinamikus tesztek tervezése alapvet&#337;en az alábbi három lépésb&#337;l áll:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>A tesztelés alanyának, céljának meghatározása (test condition)</p></li><li class="listitem"><p>Tesztesetek (test cases) specifikálása</p></li><li class="listitem"><p>Teszt folyamat (test procedure) specifikálása</p></li></ol></div><p>A tesztelési folyamathoz kapcsolódnak még a teszt készlet (test suite), hibamodell és lefedettség (test coverage) fogalmak is.</p><div class="sect2" title="4.1.1. Tesztelés alanya (test condition)"><div class="titlepage"><div><div><h3 class="title"><a name="d0e1655"></a>4.1.1. 
      
               <a name="_Toc291171711"></a>Tesztelés alanya (test condition)</h3></div></div></div><p>A tesztelés alanya lehet rendszer egy olyan jellemz&#337;je, amely ellen&#337;rizhet&#337; egy vagy több teszt esettel. Ilyen lehet például:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>funkció,</p></li><li class="listitem"><p>tranzakció,</p></li><li class="listitem"><p>képesség (feature),</p></li><li class="listitem"><p>min&#337;ségi jellemz&#337;,</p></li><li class="listitem"><p>strukturális elem.</p></li></ol></div><p></p></div><div class="sect2" title="4.1.2. Teszteset"><div class="titlepage"><div><div><h3 class="title"><a name="d0e1679"></a>4.1.2. 
      
               <a name="_Toc291171712"></a>Teszteset</h3></div></div></div><p>Egy teszteset az alábbi összetev&#337;kb&#337;l áll:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>végrehajtási prekondíciók (preconditions)</p></li><li class="listitem"><p>input értékek halmaza</p></li><li class="listitem"><p>elvárt eredmény</p></li><li class="listitem"><p>végrehajtási posztkondíciók (postconditions)</p></li></ol></div><p>Egy teszteset célja egy meghatározott vezérlési út végrehajtatása a tesztelend&#337; program egységben, vagy egy meghatározott követelmény teljesülésének ellen&#337;rzése.</p><p>Egy teszteset végrehajtása esetén a rendszert egy megadott kezd&#337; állapotban kell hozni (prekondíciók), megadott input értékek halmazával végre kell hajtatni a tesztelt elemet, majd a teszt futásának eredményét össze kell hasonlítani az elvárt eredménnyel és ellen&#337;rizni kell, hogy a végrehajtás után a rendszer az elvárt állapotba (posztkondíciók) került-e.</p><p>Példaként tételezzünk fel egy olyan program modult, amely a felhasználótól bekér néhány adatot, és megnyomja a &#8222;Számolj&#8221;gombot. A modul a megadott adatokat és adatbázisban tárolt egyéb értékeket felhasználva elvégez valamilyen számítást, majd az eredményeket adatbázisba menti. Ennek a modulnak egy tesztesete tartalmazza:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>a felhasználói adatokat (input értékek halmaza),</p></li><li class="listitem"><p>a számítás helyes eredményét (elvárt eredmény),</p></li><li class="listitem"><p>prekondícióként azt, hogy a felhasználó megnyomta a &#8222;Számolj&#8221; gombot, és az adatbázis tartalmazza a számításhoz szükséges értékeket,</p></li><li class="listitem"><p>posztkondícióként, hogy a számítás eredményei bekerültek az adatbázis megfelel&#337; tábláiba.</p></li></ol></div></div><div class="sect2" title="4.1.3. Teszt specifikáció"><div class="titlepage"><div><div><h3 class="title"><a name="d0e1718"></a>4.1.3. 
      
               <a name="_Toc291171713"></a>Teszt specifikáció</h3></div></div></div><p>Egy teszteset végrehajtásához szükséges tevékenységek sorozatának a leírása. Szokás teszt forgatókönyvnek (manual test script) is nevezni.</p></div><div class="sect2" title="4.1.4. Tesztkészlet"><div class="titlepage"><div><div><h3 class="title"><a name="d0e1725"></a>4.1.4. 
      
               <a name="_Toc291171714"></a>Tesztkészlet</h3></div></div></div><p>Egy tesztkészlet tesztesetek és hozzájuk tartozó teszt specifikációk halmaza. Csoportosítható egy teszt alanyra, vagy egy vizsgált hibára.</p><p>A tesztkészletet megfelel&#337; módon archiválni kell, mert egy tesztkészletet a fejlesztés során többször is végre kell hajtani, s&#337;t, a rendszer kés&#337;bbi változtatásainál is szerepet kap, annak ellen&#337;rzésére használható, hogy a változtatás hatására nem keletkezett-e újabb hiba.</p><p></p></div><div class="sect2" title="4.1.5. Hibamodell"><div class="titlepage"><div><div><h3 class="title"><a name="d0e1735"></a>4.1.5. 
      
               <a name="_Toc291171715"></a>Hibamodell</h3></div></div></div><p>Azon (feltételezett) szoftver hibák halmaza, amelyre a teszt tervezés irányul. A tesztesethez kapcsolódó példához a hibamodell azt rögzítheti, hogy az alábbi hibák következhetnek be: </p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>számítási hibák,</p></li><li class="listitem"><p>adatbázis lekérdezési hibák (rossz adatokat használunk fel a számításhoz),</p></li><li class="listitem"><p>az adatbázisba módosításának hibák (a számítás eredménye rosszul kerül be az adatbázisba).</p></li></ol></div><p>A hibamodell a tesztesetek tervezéséhez ad támpontokat.</p><p></p></div><div class="sect2" title="4.1.6. Teszt folyamat"><div class="titlepage"><div><div><h3 class="title"><a name="d0e1755"></a>4.1.6. 
      
               <a name="_Toc291171716"></a>Teszt folyamat</h3></div></div></div><p>Egy rendszer teljes tesztelésének megtervezéséhez (ami a teszt menedzsment egyik feladata, így a következ&#337; fejezetben foglalkozunk vele részletesebben), az alábbiakat foglalja magában:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>a szükséges tesztelési célok meghatározása,</p></li><li class="listitem"><p>minden tesztelési célhoz a szükséges tesz készlet definiálása</p></li><li class="listitem"><p>az egyes teszt készletekben foglalt tesztek ütemezésének és a végrehajtásuk dokumentálásának megtervezése.</p></li></ol></div><p>A teszt folyamat terve a rendszer specifikációjának egy fejezete lehet, de összetettebb rendszerek esetén általában külön teszt specifikáció készül.</p><p></p></div><div class="sect2" title="4.1.7. Teszt lefedettség"><div class="titlepage"><div><div><h3 class="title"><a name="d0e1775"></a>4.1.7. 
      
               <a name="_Toc291171717"></a>Teszt lefedettség</h3></div></div></div><p>A teszt lefedettség a számszer&#369; értékelése annak, hogy a tesztelési tevékenység mennyire alapos, illetve hogy egy adott id&#337;pontban hol tart. A &#8222;Már majdnem kész vagyok, f&#337;nök!&#8221; és a &#8222;Három hete ezen dolgozom, f&#337;nök!&#8221; meglehet&#337;sen szubjektív mértékek. (Nem tudom megállni ezen a ponton, hogy ne idézzem a szoftverfejlesztés egyik alapvet&#337; &#8222;természeti törvényét&#8221;: egy szoftver projekt a rendelkezésre álló id&#337; 90%-ában 90%-os készültségi fokon áll&#8230;)</p><p>Amióta felismertük, hogy a tesztelés a fejlesztési folyamat fontos (és sajnos er&#337;forrás igényes, tehát költséges) része, folyamatosan keressük a folyamat el&#337;rehaladásának a mérési lehet&#337;ségeit.</p><p>A teszt lefedettség számszer&#369;sítése alkalmas a tesztelési tevékenységet értékelésére az alábbi szempontok szerint:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Lehet&#337;séget ad a tesztelési tevékenység min&#337;ségének mérésére.</p></li><li class="listitem"><p>Lehet&#337;ség biztosít arra, hogy megbecsüljük, ennyi er&#337;forrást kell még a fejlesztési projekt hátralev&#337; idejében tesztelési tevékenységre fordítani.</p></li></ol></div><p>Az egyes tesztelési technikák más és más lefedettségi mér&#337;számokat alkalmaznak. A specifikáció alapú technikák esetén arra adhatnak választ, hogy a követelmények milyen mértékben lettek tesztelve, a struktúra alapú technikák esetén pedig, hogy a kód milyen mértékben lett ellen&#337;rizve.</p><p>A lefedettségi mér&#337;számok tehát arra nézve adnak információt, hogy milyen készültségi szinten áll a tesztelési tevékenység, és a tesztelési terv részeként meghatározzák, hogy milyen feltételek esetén tekinthetjük a tevékenységet késznek.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch03s02.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch04s02.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">3.2. 
      
            Statikus elemzés&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;4.2. 
      
            A teszt tervezési technikák fajtái</td></tr></table></div></body></html>