<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
   <title>5.2. System Level Testing (SLT)</title><link rel="stylesheet" href="style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="index.html" title="Szoftvertesztelés"><link rel="up" href="ch05.html" title="5. fejezet - Integrációs tesztek"><link rel="prev" href="ch05.html" title="5. fejezet - Integrációs tesztek"><link rel="next" href="ch05s03.html" title="5.3. User Acceptance Testing (UAT)"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">5.2. 
                           
            System Level Testing (SLT)</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch05.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">5. fejezet - Integrációs tesztek</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch05s03.html">Következ&#337;</a></td></tr></table><hr></div><div class="sect1" title="5.2. System Level Testing (SLT)"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e2864"></a>5.2. 
                           
            <a name="_Toc291176402"></a>System Level Testing (SLT)</h2></div></div></div><p>A rendszer összes komponensének teljes kör&#369; (funkcionális, nem funkcionális) tesztelése. Feladata annak megállapítása, hogy a rendszer kiadható-e a megrendel&#337;nek. Ez tehát egy végs&#337; ellen&#337;rzési fázis a fejlesztési folyamatban. Szokás elnevezése még: "release test", a tesztelés tárgyát képez&#337; rendszerváltozat pedig gyakran nevezik "alpha version"-nek.</p><p>Bár a tesztelési munka még fejleszt&#337; szervezeten belül folyik, szükséges az éles használat környezetének minél pontosabb szimulációja.</p><p>A tesztelés célja kett&#337;s:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Verifikációs: a rendszer olyan hibáinak megtalálása, amelyek az eddigi tesztelési tevékenységek során nem mutatkoztak meg.</p></li><li class="listitem"><p>Validációs: f&#337;leg a nem funkcionális követelmények tesztelése segítségével meggy&#337;z&#337;dni arról, hogy a felhasználó céljainak megfelel&#337; a rendszer m&#369;ködése.</p></li></ol></div><p>Ezen célok elérésére a rendszert több szempont szerint tesztelhetjük.</p><div class="sect2" title="5.2.1. Szolgáltatás tesztelés"><div class="titlepage"><div><div><h3 class="title"><a name="d0e2884"></a>5.2.1. 
                              
               <a name="_Toc291176403"></a>Szolgáltatás tesztelés</h3></div></div></div><p>Célja annak megállapítása, hogy a rendszer minden funkcionális követelményt implementál, és azok helyesen m&#369;ködnek.</p></div><div class="sect2" title="5.2.2. Mennyiségi tesztelés"><div class="titlepage"><div><div><h3 class="title"><a name="d0e2891"></a>5.2.2. 
                                 
               <a name="_Toc291176404"></a>Mennyiségi tesztelés </h3></div></div></div><p>A szoftver m&#369;ködését nagy mennyiség&#369; adattal teszteljük a kapacitáskorlátok ellen&#337;rzésére. Ellen&#337;rizzük, hogy az adatmennyiség nem okoz-e hibás m&#369;ködést. Végrehajtási / válasz id&#337;ket is figyelhetünk, mérhetünk, amely már a terhelési tesztek el&#337;készítését jelenti.</p></div><div class="sect2" title="5.2.3. Terheléses tesztelés (Stressz-tesztelés)"><div class="titlepage"><div><div><h3 class="title"><a name="d0e2898"></a>5.2.3. 
                                    
               <a name="_Toc291176405"></a>Terheléses tesztelés (Stressz-tesztelés)</h3></div></div></div><p>A tesztelt rendszert valamilyen szempontból er&#337;s terhelésnek teszi ki. Fontos feladata a megfelel&#337; válaszid&#337;k ellen&#337;rzése. Ennek érdekében:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Vizsgálni kell, hogy a rendszer adott id&#337;korláton belül hogyan teljesít nagy mennyiség&#369; adatokon dolgozva.</p></li><li class="listitem"><p>Intenzív feldolgozást kívánó helyzeteket kell teremteni, melyek széls&#337;ségesek, de el&#337;fordulhatnak.</p></li><li class="listitem"><p>A robosztusság ellen&#337;rzésére érdemes a terhelést olyan szintre is emelni, amely (elvileg) a használat során nem fordulhat el&#337;.</p></li></ol></div></div><div class="sect2" title="5.2.4. Használhatósági tesztelés"><div class="titlepage"><div><div><h3 class="title"><a name="d0e2915"></a>5.2.4. 
                                       
               <a name="_Toc291176406"></a>Használhatósági tesztelés </h3></div></div></div><p>A rendszer egy meghatározott felhasználó által, egy meghatározott felhasználási körben használva, meghatározott célok hatékony és produktív elérésére, mennyire kielégít&#337; és mennyire vezet megelégedésre. Minden felhasználói szerepkört, minden használati módot meg kell vizsgálni.</p></div><div class="sect2" title="5.2.5. Biztonsági tesztelés"><div class="titlepage"><div><div><h3 class="title"><a name="d0e2922"></a>5.2.5. 
                                          
               <a name="_Toc291176407"></a>Biztonsági tesztelés </h3></div></div></div><p>Az adatbiztonsággal és adatvédelemmel kapcsolatos hibák vizsgálata. A mai, elosztott architektúrájú, gyakran (legalább részben) Web alapú rendszerek esetén egyre nagyobb a jelent&#337;sége, ezért ezzel e kérdéssel egy külön fejezetben is foglalkozunk.</p></div><div class="sect2" title="5.2.6. Teljesítménytesztelés"><div class="titlepage"><div><div><h3 class="title"><a name="d0e2929"></a>5.2.6. 
                                             
               <a name="_Toc291176408"></a>Teljesítménytesztelés </h3></div></div></div><p>A teljesítmény vagy a hatékonyság mérése különböz&#337; terheléseknél és konfigurációkra meghatározott válaszid&#337;k és feldolgozási sebességek formájában. </p></div><div class="sect2" title="5.2.7. Konfigurációtesztelés"><div class="titlepage"><div><div><h3 class="title"><a name="d0e2936"></a>5.2.7. 
                                                
               <a name="_Toc291176409"></a>Konfigurációtesztelés </h3></div></div></div><p>Különböz&#337; környezetek (hardver, operációs rendszer, egyéb szoftver installációk) lehetségesek.</p><p>Ha a programnak korábbi rendszerekhez kell kapcsolódniuk, vagy a program egy korábbi változatát váltják le: ellen&#337;rizni kell a kompatibilitást vagy a konverziós eljárásokat.</p></div><div class="sect2" title="5.2.8. Megbízhatósági tesztelés"><div class="titlepage"><div><div><h3 class="title"><a name="d0e2945"></a>5.2.8. 
                                                   
               <a name="_Toc291176410"></a>Megbízhatósági tesztelés </h3></div></div></div><p>Ha program céljai között megbízhatósággal kapcsolatos speciális kitételek szerepelnek.</p><p>A megbízhatósági teszteknek adott esetben ki kell terjedniük a rendszer programozási- hardver- vagy adathibák bekövetkezte utáni felállására, m&#369;ködésbe visszaállására.</p></div><div class="sect2" title="5.2.9. Dokumentációtesztelés"><div class="titlepage"><div><div><h3 class="title"><a name="d0e2954"></a>5.2.9. 
                                                      Dokumentációtesztelés</h3></div></div></div><p>Felhasználói és fejlesztési dokumentumokra egyaránt vonatkozik. </p><p>A fejlesztési dokumentáció esetén annak teljességét és az elkészült rendszerrel való összhangját kell vizsgálni.</p><p>A felhasználói dokumentációban szerepl&#337; összes illusztratív példát le kell képezni tesztesetekké és végre is kell hajtani velük a tesztelést.</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch05.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ch05.html">Fel</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch05s03.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">5. fejezet - Integrációs tesztek&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;5.3. 
                                                         
            User Acceptance Testing (UAT)</td></tr></table></div></body></html>