<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
   <title>5. fejezet - Integrációs tesztek</title><link rel="stylesheet" href="style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="index.html" title="Szoftvertesztelés"><link rel="up" href="index.html" title="Szoftvertesztelés"><link rel="prev" href="ch04s05.html" title="4.5. Gyakorlat alapú technikák"><link rel="next" href="ch05s02.html" title="5.2. System Level Testing (SLT)"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">5. fejezet - Integrációs tesztek</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch04s05.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch05s02.html">Következ&#337;</a></td></tr></table><hr></div><div class="chapter" title="5. fejezet - Integrációs tesztek"><div class="titlepage"><div><div><h2 class="title"><a name="d0e2703"></a>5. fejezet - Integrációs tesztek</h2></div></div></div><p>Az integrációs tesztek az egységteszteket követik. Az egység teszt szorosan kapcsolódik az implementációs fázishoz, és biztosítja, hogy a részegységek önmagukban már helyesen m&#369;ködnek. így ha az integrációs tesztek során hibát észlelünk, az feltehet&#337;leg a modulok együttm&#369;ködéséb&#337;l adódik.</p><p>Az integrációs teszteknek következ&#337; fázisait különböztetjük meg:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>technikai integrációs teszt (Integration Level Testing, ILT),</p></li><li class="listitem"><p>rendszerteszt (System Level Testing , SLT),</p></li><li class="listitem"><p>elfogadtatási teszt (User Acceptance Testing, UAT).</p></li></ol></div><p>Ezek különböznek az integráltság szintjében, és részben a céljaikban is.</p><div class="sect1" title="5.1. Integration Level Testing (ILT)"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e2722"></a>5.1. 
         
            <a name="_Toc291176396"></a>Integration Level Testing (ILT)</h2></div></div></div><p>Célja az együttm&#369;köd&#337; egységek vizsgálata. Ezért a teszteléshez egy részrendszert állítunk össze a már önmagában tesztelt elemekb&#337;l. Ezek többnyire csak technikai, nem funkcionális részrendszerek, ezért probléma lehet a megfelel&#337; tesztesetek el&#337;állítása.</p><p>Az ILT szemlélete els&#337;sorban verifikációs, tehát a hibák megtalálására irányul.</p><div class="sect2" title="5.1.1. Integrációs stratégiák"><div class="titlepage"><div><div><h3 class="title"><a name="d0e2731"></a>5.1.1. 
            
               <a name="_Toc291176397"></a>Integrációs stratégiák</h3></div></div></div><p>A részrendszerek összeépítésére és a tesztesetek megtervezésére és futtatására különböz&#337; stratégiák alakultak ki.</p><div class="sect3" title="5.1.1.1. &#34;Big-bang&#34; integráció"><div class="titlepage"><div><div><h4 class="title"><a name="d0e2738"></a>5.1.1.1. 
               
                  <a name="_Toc291176398"></a>"Big-bang" integráció</h4></div></div></div><p>Feltételezzük, hogy a rendszer minden egység rendelkezésre áll, és ezekb&#337;l egyb&#337;l a teljes rendszer építjük fel, azaz valójában az ITL kimarad, és egyb&#337;l a System Level Testing következik. El&#337;nye, hogy a testeseteket könnyebben le lehet vezetni a követelmény analízisb&#337;l és nagyon kevés segédkódot kell írni a tesztek végrehajtásához. Hátránya viszont, hogy nagyon nehéz a hibák okát megtalálni, mert egy hibajelenséget több hiba együttese is okozhat (a hibák következményei "összemosódnak"). Ezért legfeljebb nagyon egyszer&#369; rendszerek esetén alkalmazható</p></div><div class="sect3" title="5.1.1.2. Inkrementációs integrációs és tesztelési stratégia"><div class="titlepage"><div><div><h4 class="title"><a name="d0e2745"></a>5.1.1.2. 
                  
                  <a name="_Toc291176399"></a>Inkrementációs integrációs és tesztelési stratégia</h4></div></div></div><p>Ebben az esetben a rendszer elemeit fokozatosan integráljuk, és minden egyes integrációs szinten teszteket hajtunk végre. A folyamat tehát az alábbi lépésekb&#337;l áll:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Néhány elemet (modult vagy részrendszert) kombinálunk.</p></li><li class="listitem"><p>Olyan teszteket futtatunk, amelyek csak az összeépített elemeket igénylik.</p></li><li class="listitem"><p>Ha minden teszt sikeres, újabb elemeket teszünk hozzá a rendszerhez. </p></li><li class="listitem"><p>További teszteseteket tervezünk, amelyek az új elemek meglétét is igénylik.</p></li><li class="listitem"><p>Minden eddigi tesztet újra lefuttatunk.</p></li></ol></div><p>A fenti iterációt addig folytatjuk, amíg a teljes rendszert összeépítettük, és azon valamennyi teszt sikeresen lefutott.</p><p>Példa:</p><p></p><p></p><div class="mediaobject"><img src="images/kep11.png"></div><p>Figyeljük meg, hogy a kib&#337;vített rendszeren újra kell futtatnunk az el&#337;z&#337;leg már sikeresen lefutott teszteket is, hiszen nem lehetünk biztosak abban, hogy az újabb modulok integrációja nem okoz hibát a korábbi modulok m&#369;ködésében. Ez a futtatandó tesztesetek számának exponenciális növekedését jelenti, ami egy bonyolult rendszer esetén nagyon er&#337;forrás igényessé teszi a folyamatot.</p><p>Mivel a tesztelés tárgya mindig csak egy részrendszer, annak m&#369;ködtetéséhez tesztelési környezetet kell biztosítani, ami segédkódok írását jelenti. A biztosítandó tesztelési környezet attól függ, milyen integrációs módszert alkalmazunk. Elvben két lehetséges megközelítés közül választhatunk:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>top-down integráció</p></li><li class="listitem"><p>bottom-up integráció</p></li></ol></div><p>Többnyire a két megközelítés valamilyen ötvözetét használják a gyakorlatban.</p></div><div class="sect3" title="5.1.1.3. Top-down integráció"><div class="titlepage"><div><div><h4 class="title"><a name="d0e2793"></a>5.1.1.3. 
                     
                  <a name="_Toc291176400"></a>Top-down integráció</h4></div></div></div><p></p><div class="mediaobject"><img src="images/kep12.png"></div><p>Folyamata:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>A hierarchia legfels&#337; szintjén álló elem tesztelésével kezdjük.</p></li><li class="listitem"><p>Az egy szinttel lejjebb álló elemek viselkedését és iterface-ét szimuláló ideiglenes elemek (stub) szükségesek.</p></li><li class="listitem"><p>Ha a teszt sikeres, az ideiglenes elemeket a valódiakkal helyettesítjük, az általuk használtakat pedig újabb ideiglenes elemekkel szimuláljuk.</p></li></ol></div><p>El&#337;nyei: </p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Jól illeszkedik a top-down programfejlesztési módszerekhez. </p></li><li class="listitem"><p>Egy modul a megírása után rögtön tesztelhet&#337;. </p></li><li class="listitem"><p>Az esetleges tervezési hibák korán kiderülnek, és idejében orvosolhatók. </p></li><li class="listitem"><p>Viszonylag korán rendelkezésre áll egy korlátozott képesség&#369; rendszer.</p></li></ol></div><p>Hátrányai: </p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Bonyolult lehet a szimulációt végz&#337; ideiglenes rutinok megírása. </p></li><li class="listitem"><p>A hierarchia fels&#337; szintjein álló modulok sokszor nem szolgáltatnak outputot. A teszteléshez külön eredmény-generáló "betétek" szükségesek.</p></li></ol></div><p></p></div><div class="sect3" title="5.1.1.4. Bottom-up integráció"><div class="titlepage"><div><div><h4 class="title"><a name="d0e2842"></a>5.1.1.4. 
                        
                  <a name="_Toc291176401"></a>Bottom-up integráció</h4></div></div></div><p></p><div class="mediaobject"><img src="images/kep13.png"></div><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>El&#337;ször a legalsó szinten lev&#337; modulokat teszteljük, majd a hierarchiában felfelé haladunk.</p></li><li class="listitem"><p>Ehhez a fels&#337; szinteket szimuláló tesztelési környezetet (test driver) kell írni.</p></li><li class="listitem"><p>Ha a teszt sikeres, a teszt driver-eket a valódi implementált elemekre cseréljük, és a következ&#337; szintet helyettesítjük test driver-ekkel.</p></li></ol></div></div></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch04s05.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch05s02.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">4.5. 
      
            Gyakorlat alapú technikák&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;5.2. 
                           
            System Level Testing (SLT)</td></tr></table></div></body></html>