<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
   <title>6.12. &#8222;Szimatoló támadás &#8211; Hálózati Lehallgatás&#8221; (Sniffing Attacks - Network Eavesdropping)</title><link rel="stylesheet" href="style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="index.html" title="Szoftvertesztelés"><link rel="up" href="ch06.html" title="6. fejezet - Biztonsági tesztelés"><link rel="prev" href="ch06s11.html" title="6.11. &#8222;Er&#337;forrás Manipuláció &#8211; Kémprogram&#8221; (Resource Manipulation &#8211; Spyware)"><link rel="next" href="ch06s13.html" title="6.13. &#8222;átverés &#8211; oldalakon keresztüli kérelem hamisítás&#8221; (Spoofing - Cross-Site Request Forgery (CSRF))"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">6.12. 
      
            &#8222;Szimatoló támadás &#8211; Hálózati Lehallgatás&#8221; (Sniffing Attacks - Network Eavesdropping)</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch06s11.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">6. fejezet - Biztonsági tesztelés</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch06s13.html">Következ&#337;</a></td></tr></table><hr></div><div class="sect1" title="6.12. &#8222;Szimatoló támadás &#8211; Hálózati Lehallgatás&#8221; (Sniffing Attacks - Network Eavesdropping)"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e3875"></a>6.12. 
      
            <a name="Description26"></a>&#8222;Szimatoló támadás &#8211; Hálózati Lehallgatás&#8221; (Sniffing Attacks - Network Eavesdropping)</h2></div></div></div><div class="sect2" title="6.12.1. Leírás"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3880"></a>6.12.1. 
      
               <a name="_Toc291181682"></a>Leírás</h3></div></div></div><p>A Hálózati Lehallgatás (Network Eavesdropping) vagy más néven hálózati szimatolás (network sniffing) egy olyan hálózati réteg támadás, ami azt a célt szolgálja, hogy csomagokat fogjunk el a hálózatban, ami mások számítógépér&#337;l származik és az ebben lév&#337; adatokban olyan kényes információkat találjunk, mint a jelszavak, session tokenek vagy bármilyen nem&#369; titkos információ.</p><p>Ezt a támadást a &#8222;hálózati szimatoló&#8221;-knak (network sniffer) nevezett eszközökkel lehet kivitelezni. Ezek az eszközök csomagokat gy&#369;jtenek a hálózaton és az eszköz min&#337;ségét&#337;l függ&#337;en a protokoll dekóderekhez vagy a stream újrailleszt&#337;khöz hasonlóan analizálják a begy&#369;jtött adatokat.</p><p>A hálózat környezetére néhány feltételnek teljesülnie kell, hogy a szimatolás hatékony legyen:</p><p>&#8226; LAN környezet HUB-okkal (LAN + HUB).</p><p>Ez az ideális eset, mivel a HUB egy hálózati ismétl&#337; eszköz, ami duplikál minden, akármelyik porton keresztül érkezett hálózati keretet, így a támadás nagyon egyszer&#369;en kivitelezhet&#337;, mivel más feltételeknek nem is kell megfelelni.</p><p>&#8226; LAN környezet kapcsolókkal (LAN + SWITCH)</p><p>Hogy a hallgatózás eredményes legyen, egy el&#337;zetes feltételnek teljesülnie kell. Mivel a switch alapesetben csak egy keretet küld a portnak, szükségünk van egy olyan mechanizmusra, ami duplikálja vagy átirányítja a hálózati csomagokat a rosszindulatú rendszer részére. Például ahhoz, hogy duplikáljuk a forgalmat egyik portról a másikra, egy különleges beállításra lesz szükségünk a switch-ben. Hogy átirányítsuk a támadást egyik portról a másikra, szükségünk lesz egy el&#337;z&#337;leges kihasználásra, mint például az arp spoof támadás. Ebben a támadásban a rosszindulatú rendszer útválasztóként (router) m&#369;ködik az áldozatok közötti kommunikációban, lehet&#337;vé téve azt, hogy &#8222;kiszimatoljuk&#8221; a felcserélt csomagokat.</p><p>&#8226; WAN környezet</p><p>Ebben az esetben, a hálózati &#8222;szimatolás&#8221; sikeréhez arra van szükség, hogy rosszindulatú rendszer útválasztóként (router) m&#369;ködjön a kliens és a szerver közötti kommunikációban Ezen hiba kihasználásának egyik módja, ha DNS áltámadást indítunk a kliens rendszer ellen.</p><p>A &#8222;Hálózati Lehallgatás&#8221; egy passzív támadás, amit nagyon nehéz felfedezni. Fölfedezhet&#337; a megel&#337;z&#337; állapot hatásából vagy néhány esetben rábírhatjuk a rosszindulatú szervert, hogy válaszoljon egy olyan hamis kérelemre, amit a rosszindulatú rendszer IP címére küldtünk, de egy másik rendszer MAC címével.</p></div><div class="sect2" title="6.12.2. PéLDáK"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3905"></a>6.12.2. 
      
               <a name="Examples24"></a>PéLDáK</h3></div></div></div><p>Amikor a HUB elnevezés&#369; hálózati eszközt használunk egy Helyi Hálózat topológiájában, akkor a &#8222;Hálózati Lehallgatás&#8221; kivitelezése sokkal könnyebbé válik, mivel az eszköz mindenféle, egy porton bejöv&#337; adatforgalmat duplikál az összes többi portra. Egy protokoll elemz&#337;t (protocol analyzer) használva a támadó a LAN egész adatforgalmára ráteheti a kezét és így kényes információkat szerezhet meg.</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch06s11.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ch06.html">Fel</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch06s13.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">6.11. 
      
            &#8222;Er&#337;forrás Manipuláció &#8211; Kémprogram&#8221; (Resource Manipulation &#8211; Spyware)&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;6.13. 
      
            &#8222;átverés &#8211; oldalakon keresztüli kérelem hamisítás&#8221; (Spoofing - Cross-Site Request Forgery (CSRF))</td></tr></table></div></body></html>