<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
   <title>6.4. Trójai</title><link rel="stylesheet" href="style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="index.html" title="Szoftvertesztelés"><link rel="up" href="ch06.html" title="6. fejezet - Biztonsági tesztelés"><link rel="prev" href="ch06s03.html" title="6.3. Kártékony kód beágyazása &#8211; Logikai/Id&#337;zített bomba"><link rel="next" href="ch06s05.html" title="6.5. Azonosítási folyamat kihasználása &#8211; Account kizárási támadás"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">6.4. 
      
            Trójai</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch06s03.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">6. fejezet - Biztonsági tesztelés</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch06s05.html">Következ&#337;</a></td></tr></table><hr></div><div class="sect1" title="6.4. Trójai"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e3246"></a>6.4. 
      
            <a name="Description7"></a>Trójai</h2></div></div></div><div class="sect2" title="6.4.1. Leírás"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3251"></a>6.4.1. 
      
               <a name="_Toc291181644"></a>Leírás</h3></div></div></div><p>A Trójai olyan program ami megbízható alkalmazásnak álcázva tartalmaz ártalmas kódot. Az ártalmas kód lehet egyébként hasznos alkalmazás része, rejt&#337;zhet egy elektronikus levél hivatkozása mögött vagy el lehet rejtve JavaScript-et futtató oldalakon, hogy titkos támadásokat intézzen sebezhet&#337; internet böngész&#337;k ellen.</p><p>További részleteket az Ember-a-böngész&#337;-támadások-mögött (<a class="ulink" href="http://www.owasp.org/index.php/Man-in-the-browser_attack" target="_top">Man-in-the-browser attack</a>) cím&#369; részben olvashat.</p></div><div class="sect2" title="6.4.2. A Trójai 7 f&#337; típusa"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3263"></a>6.4.2. 
      
               <a name="The_7_Main_Types_of_Trojan_Horse"></a>A Trójai 7 f&#337; típusa</h3></div></div></div><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Távoli Hozzáférés&#369; Trójai (Remote Access Trojan; RAT): Arra tervezték, hogy teljes irányításd biztosítson a támadónak a fert&#337;zött számítógép fölött. Ezt a Trójait általában segédprogramnak álcázzák.</p></li><li class="listitem"><p>Adatküld&#337; Trójai (Data Sending Trojan): Ez a fajta Trójai valamilyen billenty&#369;lenyomás-rögzít&#337; (keylogger) technológiát használ, hogy értékes adatokra tegyen szert, például jelszavakra, hitelkártya és netbank adatokra vagy azonnali üzenetekre, amiket aztán visszaküld a támadónak.</p></li><li class="listitem"><p>Megsemmisít&#337; Trójai (Destructive Trojan): Trójai, amit arra terveztem, hogy az áldozat gépén tárolt adatokat megsemmisítse.</p></li><li class="listitem"><p>Proxy Trójai (Proxy Trojan): Ennek a Trójainak az a célja, hogy proxy szerverként használja az áldozat számítógépét, lehet&#337;séget biztosítva arra, hogy tiltott dolgokat cselekedjen a fert&#337;zött gépr&#337;l, például banki csalással próbálkozzon vagy akár káros támadásokat indítson az interneten keresztül.</p></li><li class="listitem"><p>FTP Trójai (FTP Trojan): Ez a Trójai a 21-es porton keresztül csatlakozva lehet&#337;vé teszi a támadó számára, hogy FTP kapcsolatot létesítsen az áldozat gépével.</p></li><li class="listitem"><p>Biztonsági szoftver hatástalanító Trójai (Security software disabler Trojan): Ezt a Trójait arra tervezték, hogy semlegesítse a t&#369;zfalakhoz és vírusírtó programokhoz hasonló biztonsági programokat, lehet&#337;vé téve ez által a támadónak, hogy többfajta inváziós technológiát is használhasson az áldozat számítógépére való behatoláshoz és hogy még a számítógépen túli eszközöket is megfert&#337;zze.</p></li><li class="listitem"><p>Szolgáltatás-megtagadás támadó Trójai (Denial-of-Service attack Trojan): Ezt a Trójait arra tervezték, hogy lehet&#337;séget biztosítson a támadónak Szolgáltatás-megtagadási támadás kivitelezésére az áldozat számítógépér&#337;l.</p></li></ol></div><p></p></div><div class="sect2" title="6.4.3. Tünetek"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3291"></a>6.4.3. 
      
               <a name="Symptoms"></a>Tünetek</h3></div></div></div><p>Néhány gyakori tünet:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>A háttérkép vagy más háttérbeállítás magától megváltozik</p></li><li class="listitem"><p>Az egérmutató elt&#369;nik</p></li><li class="listitem"><p>A programok maguktól betölt&#337;dnek és kilépnek</p></li><li class="listitem"><p>állandóan furcsa figyelmeztet&#337; ablakok, üzenetek és kérdés dobozok jelennek meg</p></li><li class="listitem"><p>Az e-mail kliens magától leveleket küld mindenkinek a felhasználó címlistájára</p></li><li class="listitem"><p>A Windows magától leáll</p></li><li class="listitem"><p>A rendszer magától újraindul</p></li><li class="listitem"><p>Az internet hozzáférés adatai megváltoznak</p></li><li class="listitem"><p>A felhasználó ez irányú tevékenysége nélkül is nagy az internetkapcsolat terheltsége</p></li><li class="listitem"><p>A számítógép m&#369;ködése nagyon nagy er&#337;forrásokat emészt fel (a számítógép lelassul)</p></li><li class="listitem"><p>A Ctrl + Alt + Del gombkombináció nem m&#369;ködik</p></li></ol></div></div><div class="sect2" title="6.4.4. Kockázati tényez&#337;k"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3332"></a>6.4.4. 
      
               <a name="Risk_Factors4"></a>Kockázati tényez&#337;k</h3></div></div></div><p>Magas: A Trójai át tud törni bármilyen biztonsági védelmet a hálózatban, mivel a támadó hozzáférhet egy, a hálózati bejelentkezéshez szükséges, tárolt tanúsítványokkal ellátott munkaállomáshoz. Ezeknek a birtokában a támadó az egész hálózatot veszélyeztetheti.</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch06s03.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ch06.html">Fel</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch06s05.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">6.3. 
      
            Kártékony kód beágyazása &#8211; Logikai/Id&#337;zített bomba&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;6.5. 
      
            Azonosítási folyamat kihasználása &#8211; Account kizárási támadás</td></tr></table></div></body></html>