<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
   <title>7. fejezet - Teszt menedzsment</title><link rel="stylesheet" href="style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="index.html" title="Szoftvertesztelés"><link rel="up" href="index.html" title="Szoftvertesztelés"><link rel="prev" href="ch06s13.html" title="6.13. &#8222;átverés &#8211; oldalakon keresztüli kérelem hamisítás&#8221; (Spoofing - Cross-Site Request Forgery (CSRF))"><link rel="next" href="ch07s02.html" title="7.2. A tesztmérnök és a tesztel&#337; feladatai"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">7. fejezet - Teszt menedzsment</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch06s13.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch07s02.html">Következ&#337;</a></td></tr></table><hr></div><div class="chapter" title="7. fejezet - Teszt menedzsment"><div class="titlepage"><div><div><h2 class="title"><a name="d0e4044"></a>7. fejezet - Teszt menedzsment</h2></div></div></div><p>A tesztelési tevékenység a fejlesztési folyamat szerves része. A tesztelés helyét a fejlesztési folyamatban a V modell szemlélteti.</p><p>Ebben a fejezetben áttekintést adunk arról, hogy</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>hogyan kell megszervezni és irányítani a tesztelést,</p></li><li class="listitem"><p>hogyan illeszthet&#337; be a tesztelés a fejlesztési folyamat menedzsmentjébe.</p></li></ol></div><p>A tesztelésnek a fejlesztési folyamatba illesztése során az alábbi szempontokat kell figyelembe venni.</p><p>A tesztelés helye a fejleszt&#337; csoportban</p><p>Megvizsgálandók a következ&#337; kérdések:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>A tesztel&#337;k függetlensége. A független tesztel&#337;i szervezet hasznai és hátrányai.</p></li><li class="listitem"><p>A teszteléshez szükséges szerepkörök.</p></li><li class="listitem"><p>A tesztmérnök (test designer) és a tesztel&#337; (tester) feladatai.</p></li></ol></div><p>Teszt tervezés</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>A teszt tervezés szintjei.</p></li><li class="listitem"><p>A teszt tervezés célja és a teszt specifikáció, teszt terv tartalma az IEEE 829 szabvány szerint.</p></li><li class="listitem"><p>A teszt el&#337;készítés és a teszt végrehajtás lépései.</p></li><li class="listitem"><p>A teszt elfogadási kritériumai a tesztelés különböz&#337; szintjein.</p></li></ol></div><p>A tesztfolyamat ellen&#337;rzése és követése</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>A teszt tervezés és végrehajtás metrikái.</p></li><li class="listitem"><p>A tesztelési tevékenység el&#337;rehaladásának dokumentálása az IEEE 829 szabvány szerint</p></li></ol></div><p>Konfiguráció menedzsment</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Hogyan támogathatja a konfiguráció menedzsment a tesztelési folyamatot.</p></li></ol></div><p>Kockázatok és a tesztelés</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>A tesztelés a fejlesztési kockázatok csökkentésének egyik eszköze.</p></li><li class="listitem"><p>A fejlesztési és a termék kockázat fogalma.</p></li></ol></div><p>Incidens menedzsment</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Az incidens fogalma.</p></li><li class="listitem"><p>Indicens jelentés és annak tartalma.</p></li></ol></div><p>A továbbiakban a fenti szempontok közül a legfontosabbakat elemezzük.</p><div class="sect1" title="7.1. A tesztelés szervezeti keretei"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e4124"></a>7.1. 
      
            <a name="_Toc291181707"></a>A tesztelés szervezeti keretei</h2></div></div></div><p>A megfelel&#337; tesztel&#337; szervezet felállítása az els&#337; lépés egy sikeres tesztfolyamat elvégzéséhez. Fontos, hogy az adott feladathoz legmegfelel&#337;bb szakembereket válogassuk bele a tesztcsapatba. A tesztcsapat összeállítása a teszt tárgyát képez&#337; projektt&#337;l függ.</p><p>Mivel a tesztelés a min&#337;ségbiztosítás része, azaz egyfajta értékelés, melynek eredménye nem minden esetben pozitív, ezért fontos lehet egy olyan tesztcsapat összeállítása, amely képes objektíven értékelni a programozók munkáját.</p><p>El&#337;ször a tesztcsapat függetlenségének mértékét kell meghatároznunk. A függetlenség teljes hiánya esetén a tesztel&#337;k maguk a programozók, akik a teszteket a programozói csapaton belül végzik el. Következ&#337; szint, amikor egy integrált tesztcsapat a programozók mellett dolgozik, továbbra is a programozó team tagjaként, jelentési kötelezettséggel a fejlesztési menedzser felé. Az ezt követ&#337; szinten a fejlesztési csapattól független tesztcsapat áll, akik jelentéseiket a projektmenedzsernek írják. A legfels&#337;bb szint, a teljes függetlenség, ahol a tesztelési feladatokat végz&#337; különálló tesztcsapat, aki ugyanannak a szervezeti szintnek készíti a jelentéseket, mint a fejlesztési team. A tesztel&#337; csapat függetlenségi szintjeit foglalja össze az alábbi ábra:</p><p></p><p>
      
            <img src="images/kep14.png">
   
         </p><p>8. ábra A tesztel&#337; függetlensége</p><p>A különböz&#337; területi szakért&#337;k (mint például az üzleti szakért&#337;k, technológiai szakért&#337;k, tesztautomatizálási szakért&#337;k, biztonsági tesztel&#337;k, tanúsítványtesztel&#337;k) külön független tesztcsapatokat is alkothatnak a szervezeten belül, vagy egy külön szerz&#337;dtetett tesztcsapat csoportjaiként.</p><p>Egy független tesztel&#337; több más jelleg&#369; hibát vehet észre, mint aki a programozókkal együtt dolgozik, vagy maga is programozó, mivel más rálátása lehet a projektre, illetve észrevehet olyan problémákat is, amik a fejleszt&#337; csapat gondolkodásmódjából erednek. Valamint egy független tesztel&#337;, aki a vezet&#337;i menedzsernek írja jelentéseit, &#337;szinte tud maradni, hiszen nem kell annak negatív következményeivel számolnia, hogy munkatársait bírálja, vagy menedzsere munkájának hibáira mutat rá. Egy független tesztcsapat rendelkezhet elkülönített költségvetéssel és vezetéssel, így annak tagjai is nagyobb eséllyel pályázhatnak majd jobb munkahelyi pozíciókra, hiszen nincsenek a programozók alá vagy mellé rendelve.</p><p>A független tesztcsapat hátránya lehet viszont a projektt&#337;l vagy annak részeit&#337;l való elszigetel&#337;dés. Ha a tesztel&#337; ismeri az adott programozók általános gondolkodásmódját, nagyobb eséllyel fedezi fel annak hibáit. Rosszabb esetekben el&#337;fordulhat az is, hogy a projektet nem teljesen ismerve túlzott figyelmet szentelnek annak bizonyos részegységei hibáinak feltárására, így más jelleg&#369;eket elhanyagolhatnak. Ez a kommunikációs probléma ellenszenvhez, elidegenedéshez, vádaskodáshoz vezethet.</p><p>A jól integrált csapatok is szembesülhetnek hasonló problémákkal, például a tesztel&#337;k joggal vagy jogtalanul, de gondolhatják, hogy alá vannak rendelve a programozói teamnek, a projekt többi résztvev&#337;je gondolhatja úgy, hogy a tesztelés lassítja a projekt el&#337;re menetelét, és a tesztcsapat miatt késnek a határid&#337;kkel. A programozók feleslegesnek tarthatják kódjaik ellen&#337;rzését, hiszen úgyis van saját tesztcsapatuk.</p><p>Gyakori eset, hogy a vállalatok vágyva a független tesztelés el&#337;nyeire csak azért hoznak létre ilyen csapatokat, hogy hogy hamarosan feloszlassák &#337;ket. Oka, lehet, hogy a tesztmenedzser sikertelen a fenti problémák hatékony kezelésében.</p><p>A tesztelés függetlenségének megállapításához tehát nem létezik egyedüli helyes út. Minden egyes projekthez, a projekt alkalmazási területét, kockázatszintjét, komplexitását figyelembe véve kell döntenünk. Lehetséges természetesen a projekt el&#337;rehaladásával annak különböz&#337; szintjein változtatnunk a tesztcsapat függetlenségén és összetételén. Vannak tesztek, amiket célszer&#369;bb, a mások végeznek el, más területek szakért&#337;i a projekt tárgyától függ&#337;en.</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch06s13.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch07s02.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">6.13. 
      
            &#8222;átverés &#8211; oldalakon keresztüli kérelem hamisítás&#8221; (Spoofing - Cross-Site Request Forgery (CSRF))&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;7.2. 
      
            
      
            A tesztmérnök és a tesztel&#337; feladatai</td></tr></table></div></body></html>