<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
   <title>11. fejezet - Esettanulmány</title><link rel="stylesheet" href="style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="index.html" title="Szoftvertesztelés"><link rel="up" href="index.html" title="Szoftvertesztelés"><link rel="prev" href="ch10s05.html" title="10.5. Kérdések"><link rel="next" href="ch11s02.html" title="11.2. Server oldal tesztelése"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">11. fejezet -  Esettanulmány </th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch10s05.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch11s02.html">Következ&#337;</a></td></tr></table><hr></div><div class="chapter" title="11. fejezet - Esettanulmány"><div class="titlepage"><div><div><h2 class="title"><a name="d0e6229"></a>11. fejezet -  Esettanulmány </h2></div></div></div><div class="sect1" title="11.1. Bevezetés"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e6232"></a>11.1. Bevezetés</h2></div></div></div><p>Egy kliens-szerver alakalmazás helyességét, hatékonyságát több helyen lehet és kell is ellen&#337;rizni. Minnél hamarabb derülnek ki a hibák gyengeségek, annál hamarabb lehet azokat javítani, és ebben az esetben pontosan tudjuk a helyet és azonnal javíthatjuk (ha csak a végén vesszük észre a hibát, akkor meg kell keresni, hogy mib&#337;ól ered). Ebben a fejezetben
                    egy valós fejlesztés tesztelését mutatjuk be. </p><p>Az MTA SZTAKI Kognitív informatika
                    laborja t&#369;zte ki magának a feladatot, hogy egy virtuális együttm&#369;ködési
                    rendszert hozzon létre, melynek neve VIRCA (VIRtual Collaboration Arena). Az
                    alkalmazás egy 3 dimenziós térben valós és virtuális objektumokat jelenít meg,
                    és kezel. A rendszerben tetsz&#337;leges számú és típusú komponenseket lehet
                    elhelyezni (virtuális vagy valóságos), amelyek mindegyike egy önálló alkalmazás.
                    Az els&#337; verzió után újabb igények merültek fel. Az elkészült rendszer egy
                    osztott alkalmazás lett, ami CORBA és ICE technológiákat használ. A rendszer egy
                    közös adatstruktúrát használ az elérhet&#337; komponensek nyilvántartására, a CORBA
                    naming service-t (név szolgáltatást), ami fa struktúrában tárolja a
                    komponenseket. A 3 dimenziós megjelenít&#337; ablak OGRE (nyílt forráskódú grafikai
                    motor) rendszer segítségével implementálták c++-ban. A mi rendszerünk a hálózati
                    kommunikáció lebonyolítására egy Openrtm-aist robot middleware-t használ. írtunk
                    ehhez pár kiterjesztést (ICE port, 1 fogyasztó több szolgáltató lehet&#337;ség), és a
                    projekt kezdetekor a gyári rendszer szerkeszt&#337;t használtuk. A gyári szerkeszt&#337;
                    egy Eclipse plugin, amely használatához egy több 10 megabájtos alkalmazás
                    szükséges (Eclipse), és mi rendszerünk használatakor kényelmetlen egy küls&#337; szerkeszt&#337;t
                    használni (váltogatva az aktív alkalmazást). Másik probléma, hogy a mi általunk készített kiterjesztés a hivatalos szerkeszt&#337; nem ismeri és nem is tudja használni. 
Olyan szerkeszt&#337;re volt szükség, amely képes futni az OGRE virtuális terében. A Chrome egy módosított verziója képes memóriában létrehozni a böngész&#337; képét,
ami ezután ráfeszíthet&#337; egy síkra. A kliens tehát egy böngész&#337;ben futó vékony klienst is kell tartalmazzon. A kliens oldalon egy tipikus grafikus szerkeszt&#337;t kell implementálnunk, 
ezért a javascript - mint lehetséges megoldás kizárható. Három elternatíva közül válaszhattunk:</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>FLEX</p></li><li class="listitem"><p>JAVA FX</p></li><li class="listitem"><p>Silverligth</p></li></ul></div><p>Szerettük voltna, ha az alkalmazás platform független, ezért a Silverlight-ot az els&#337; körben kizártuk. El&#337;ztetes vizsgálataink alapján ez a módosított böngész&#337; nem képes Java FX technológia használatára Ezért nem volt választásunk a FLEX kliens oldali technológiát alkalmaztuk. </p><p>A szerver oldalon szintén valamilyen platform független megoldást szerettünk volna alkalmazni, ezért a JAVA alapú megoldást választottuk. Mivel a szerkeszt&#337;höz kellett írnunk egy karakteres verziót is, ezért egy külön rétegben implementáltuk az üzleti logikát. </p><div class="figure"><a name="openrmtExtLayers"></a><p class="title"><b>11.1. ábra - A SZTAKI Openrtm kiterjesztésének felépítése</b></p><div class="figure-contents"><div align="center"><img src="images/openrtmext.png" align="middle" alt="A SZTAKI Openrtm kiterjesztésének felépítése"></div></div></div><p><br class="figure-break"> A rendszer 4 rétegb&#337;l áll, melyek a következ&#337;k:</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>megjelenítési, és vezérlési,</p></li><li class="listitem"><p>logika réteg,</p></li><li class="listitem"><p>alacsonyszint&#369; réteg.</p></li><li class="listitem"><p>programozói middleware réteg</p></li></ul></div><p> A <span class="bold"><strong>megjelenítés és a vezérlés réteg</strong></span> (zöld szín&#369;). Feladatuk a rendszer interfészének
                    biztosítása: </p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>paraméterek fogadása, ellen&#337;rzése, </p></li><li class="listitem"><p> esetleges eredmények megjelenítése,</p></li><li class="listitem"><p>Szolgáltatásokat kér a vezérl&#337; rétegt&#337;l</p></li></ol></div><p>
         </p><p>Az OpenrtmExt_Logic, <span class="bold"><strong>logikai réteg</strong></span> (sárga
                    szín&#369;) a logika réteg, amelynek feladata a megjelenítési réteg által kért
                    funkciók kiszolgálása az OpenrtmExt_Iceport és az OpenRtm alrendszerek
                    segítségével. Ez a réteg egy csomag (jar fájl), amely a web-, vagy konzol
                    alkalmazás mellet kell legyen. </p><p>
            <span class="bold"><strong>Alacsonyszint&#369; réteg</strong></span> tartalmazza az
                    Openrtm-aist implementációját, ez küls&#337; rész, és az OpenrtmExt_Iceport részt.
                    Ezek végzik az alacsony szint&#369; m&#369;veleteteket. Ezek minden esetben a futó
                    komponensben vannak beágyazva. </p><p>Az alsó rétegeket csak alkalmazzuk azoknak a tesztelése más feladata, nekünk csak az OpenrtmExt_logic, OpenrtmExt_server és Openrtm_Tools részekkel kell foglalkoznunk. A fejlesztés a klasszikus vízesés modell lépéseib&#337;l áll, a módszerek is azt
                    javasolják, csak a legtöbb több iterációt ír el&#337;, és így a rendszer finomodik.
                    </p><div class="tip" title="Tipp" style="margin-left: 0.5in; margin-right: 0.5in;"><table border="0" summary="Tip"><tr><td rowspan="2" align="center" valign="top" width="25"><img alt="[Tipp]" src="https://gyires.inf.unideb.hu/system/docbook-xsl/images/tip.png"></td><th align="left">Tipp</th></tr><tr><td align="left" valign="top"><p>A teszt eseteket már a specifikáció írásakor meg kell határozni és le kell írni a forgatókönyveket. Az egység teszteket érdemes már az els&#337; osztályok megírásánál lefuttatni, és minden módosításnál újból és újból lefuttatni. Erre a feladatra érdemes valamilyen autómatizált megoldást keresni, amely lefut lehet&#337;leg minden "fontos" alkalomkor.</p></td></tr></table></div><p>Az alkalmazásnak valójában ez a szerver oldala, azonban a kliensek egy böngész&#337;n keresztül küldik kéréseiket a szervernek. A kliens nem a hagyományos értelemben vett vékony kliens, hiszen egy grafikus szerkeszt&#337;, amelyben az elemek elhelyezése, átrendezése, összekötése a f&#337; tevékenység. Az elemek elhelyezése és a m&#369;veletek valóságos információkat igényelnek, amit a szerver oldali logika nyújt. Amikor a felhasználó elkészítette a rendszerét, akkor ténylegesen elindítja összeköti az elemeket, azaz a szerver oldali logika a kérései alapján utasítja az alacsony szint&#369; réteget (vezérli a komponenseket). A teljes toplogiát a következ&#337; ábra mutatja:</p><div class="figure"><a name="openrmtExtLayers_5"></a><p class="title"><b>11.2. ábra - Grafikus szerkeszt&#337; rendszerünk f&#337;bb komponensei és kommunikácós csatornái</b></p><div class="figure-contents"><div align="center"><img src="images/rtcextension_with_flash.png" align="middle" alt="Grafikus szerkeszt&#337; rendszerünk f&#337;bb komponensei és kommunikácós csatornái"></div></div></div><p><br class="figure-break">Ha hibásan m&#369;ködik a rendszer az számos helyen lev&#337; hiba eredménye lehet. Ezért folyamatosan kell tesztelnünk a logikában, a szerver oldalon, a kliens oldali kódban is. Minden kis változás egy létez&#337; hiba kijavítása újabb hibákhoz vezethet, amit ha csak kés&#337;bb veszünk észre, akkor nem tudjuk, hogy melyik változás okozta. </p><div class="tip" title="Tipp" style="margin-left: 0.5in; margin-right: 0.5in;"><table border="0" summary="Tip"><tr><td rowspan="2" align="center" valign="top" width="25"><img alt="[Tipp]" src="https://gyires.inf.unideb.hu/system/docbook-xsl/images/tip.png"></td><th align="left">Tipp</th></tr><tr><td align="left" valign="top"><p>Minnél hamarabb vezessünk be egy (lehet&#337;leg a projekt indulásakor) folyamatos integráció rendszert (continous integration system), ami  a kód legkisebb változása esetén lefuttatja az össze tesztet. Ezek a rendszerek levelet küldenek, ha beállítottuk. Alkalmazásával lehet&#337;ség nyílik arra, hogy midenki azonos verziót használ, és a javítások által keletkezett hibák azonnal kiderülnek.</p></td></tr></table></div><p>
         </p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch10s05.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch11s02.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">10.5. Kérdések&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;11.2. Server oldal tesztelése</td></tr></table></div></body></html>